app/controllers/arts_controller.rb

SELECT "arts".* FROM "arts" WHERE "arts"."id" IN (SELECT "arts"."id" FROM "arts" WHERE "arts"."form" = $1)  [["form", "Architecture"]]
---
  def index
    @arts = Art.search({:form => params[:form],:artist => params[:artist],:name => params[:name]})

INSERT INTO "arts" ("form", "name", "artist", "year", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["form", "Paint"], ["name", "www"], ["artist", ""], ["year", 344], ["image", ""], ["created_at", "2021-02-12 02:54:33.924713"], ["updated_at", "2021-02-12 02:54:33.924713"]]
---
  def create
    art = Art.create art_params

SELECT  "arts".* FROM "arts" WHERE "arts"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
---
  def edit
    @art = Art.find params[:id]

SELECT  "arts".* FROM "arts" WHERE "arts"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
UPDATE "arts" SET "name" = $1, "artist" = $2, "updated_at" = $3 WHERE "arts"."id" = $4  [["name", "wq"], ["artist", "wa"], ["updated_at", "2021-02-13 02:01:03.794623"], ["id", 39]]
---
  def update
    art = Art.find params[:id]
    art.update art_params

SELECT  "arts".* FROM "arts" WHERE "arts"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]
---
  def show
    @art = Art.find params[:id]

SELECT  "arts".* FROM "arts" WHERE "arts"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]
DELETE FROM "arts" WHERE "arts"."id" = $1  [["id", 28]]
---
  def destroy
    art = Art.find params[:id]
    art.destroy